| Tipo | ¿Para qué se usa? | Comentarios útiles |
|---|---|---|
| **Enteros exactos** |||
| TINYINT | Enteros muy pequeños (flags, booleanos) | -128 a 127 o 0–255 sin signo |
| SMALLINT | Enteros pequeños | -32,768 a 32,767 |
| MEDIUMINT | Enteros medianos | -8M a 8M aprox. |
| INT / INTEGER | Enteros comunes | ±2,147,483,648 |
| BIGINT | Enteros grandes (IDs, contadores) | ±9e18 |
| BIT(M) | Bits compactos | M entre 1 y 64 |
| BOOL / BOOLEAN | Valores booleanos | Es alias de TINYINT(1) |
| **Números exactos** |||
| DECIMAL(M,D) | Importes monetarios | Precisión exacta |
| NUMERIC(M,D) | Igual que DECIMAL | Sin error de flotación |
| **Flotantes** |||
| FLOAT | Decimales aproximados | Precisión simple |
| DOUBLE | Decimales aproximados | Precisión doble |
| **Fecha y hora** |||
| DATE | Solo fecha | Formato YYYY-MM-DD |
| TIME | Solo hora | HH:MM:SS |
| DATETIME | Fecha y hora | No depende zona |
| TIMESTAMP | Fecha y hora con zona UTC interna | Puede auto-actualizarse |
| YEAR | Año | 1901–2155 |
| **Cadenas** |||
| CHAR(N) | Texto fijo | 0–255 chars |
| VARCHAR(N) | Texto variable | Hasta 65 KB |
| TINYTEXT | Texto corto | 255 bytes |
| TEXT | Texto medio | 65 KB |
| MEDIUMTEXT | Texto grande | 16 MB |
| LONGTEXT | Texto muy grande | 4 GB |
| ENUM(...) | Valor único de lista | Guarda índice |
| SET(...) | Conjunto de valores | Permite varios |
| JSON | Datos JSON válidos | Funciones JSON |
| **Binarios** |||
| BINARY(N) | Binario fijo | 0–255 bytes |
| VARBINARY(N) | Binario variable | Tamaño dependiente fila |
| TINYBLOB | Binario corto | 255 bytes |
| BLOB | Binario medio | 65 KB |
| MEDIUMBLOB | Binario grande | 16 MB |
| LONGBLOB | Binario muy grande | 4 GB |
| **Geoespaciales (GIS)** |||
| GEOMETRY | Tipo geométrico genérico | — |
| POINT | Punto | (x, y) |
| LINESTRING | Línea | Secuencia de puntos |
| POLYGON | Polígono | — |
| MULTIPOINT | Varios puntos | — |
| MULTILINESTRING | Varias líneas | — |
| MULTIPOLYGON | Varios polígonos | — |
| GEOMETRYCOLLECTION | Colección de geometrías | — |
| **Atributos / extras** |||
| SERIAL | Atajo de BIGINT UNSIGNED AUTO_INCREMENT | Conveniente |
| UNSIGNED | Solo valores positivos | Duplica rango positivo |
| ZEROFILL | Relleno con ceros | Implica UNSIGNED |
| AUTO_INCREMENT | Incremento automático | Solo una por tabla |

In [3]:
%load_ext sql

In [4]:
%sql sqlite:///Data_types.db

#### **DATES & TIME** ####

In [5]:
%%sql
CREATE TABLE people ( name VARCHAR(50), bird_date DATE );

 * sqlite:///Data_types.db
(sqlite3.OperationalError) table people already exists
[SQL: CREATE TABLE people ( name VARCHAR(50), bird_date DATE );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [6]:
%sql SELECT * FROM people

 * sqlite:///Data_types.db
Done.

[('sapt', '2000-01-30')]

In [7]:
%sql INSERT INTO people (name, bird_date) VALUES ('sapt', '2000-01-30');

 * sqlite:///Data_types.db
1 rows affected.

[]

In [8]:
%sql SELECT * FROM people;

 * sqlite:///Data_types.db
Done.

[('sapt', '2000-01-30'), ('sapt', '2000-01-30')]

In [9]:
%%sql
CREATE TABLE peoplesx (
	name VARCHAR(100),
    birthdate DATE,
    birthtime TIME,
    birthdt DATETIME
);
 
INSERT INTO peoples (name, birthdate, birthtime, birthdt)
VALUES ('Elton', '2000-12-25', '11:00:00', '2000-12-25 11:00:00');
 
INSERT INTO peoples (name, birthdate, birthtime, birthdt)
VALUES ('Lulu', '1985-04-11', '9:45:10', '1985-04-11 9:45:10');
 
INSERT INTO peoples (name, birthdate, birthtime, birthdt)
VALUES ('Juan', '2020-08-15', '23:59:00', '2020-08-15 23:59:00');

 * sqlite:///Data_types.db
(sqlite3.OperationalError) table peoplesx already exists
[SQL: CREATE TABLE peoplesx (
	name VARCHAR(100),
    birthdate DATE,
    birthtime TIME,
    birthdt DATETIME
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [10]:
%sql PRAGMA table_info(peoplesx);

 * sqlite:///Data_types.db
Done.

[(0, 'name', 'VARCHAR(100)', 0, None, 0),
 (1, 'birthdate', 'DATE', 0, None, 0),
 (2, 'birthtime', 'TIME', 0, None, 0),
 (3, 'birthdt', 'DATETIME', 0, None, 0)]

In [11]:
%sql DROP TABLE peoples;

 * sqlite:///Data_types.db
(sqlite3.OperationalError) no such table: peoples
[SQL: DROP TABLE peoples;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
%%sql
Select name
FROM sqlite_master
WHERE type='table';

 * sqlite:///Data_types.db
Done.

[('people',), ('peoplesx',)]

#### **CURDATE() CURTIME() NOW()** ####

In [15]:
%sql SELECT CURDATE();

 * sqlite:///Data_types.db
(sqlite3.OperationalError) no such function: CURDATE
[SQL: SELECT CURDATE();]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [16]:
%sql SELECT current_date;

 * sqlite:///Data_types.db
Done.

[('2026-01-27',)]

In [18]:
%sql SELECT TIME('now')

 * sqlite:///Data_types.db
Done.

[('23:07:14',)]